##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения с остатком.

print("Введите 1 число:")
x = int(input())
print("Введите 2 число:")
y = int(input())
print("Сумма чисел:",x+y)
print("Разность чисел:",x-y)
print("Частное чисел:",x/y)
print("Произведение чисел:",x*y)
print("Результат целочисленного деления:",x // y)
print("Результат деления c остатком:",x // y, "остаток",x % y)
print("Результат возведения:",x ** y)



